; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v2 - type_3 ?v7 - type_1)
 	      (pred_2 ?v3 - object ?v7 - type_1)
	      (pred_3 ?v2 - type_3 ?v5 - type_2)
	      (pred_4 ?v2 - type_3 ?v3 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v2 - type_3 ?v8 ?v6 - type_1)
       :precondition (and  (pred_1 ?v2 ?v8))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v4) (pred_1 ?v2 ?v4) (pred_3 ?v2 ?v5))
       :effect (and (pred_4 ?v2 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v4)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_3 ?v1 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v5) (pred_1 ?v2 ?v4))
       :effect (and (pred_2 ?v1 ?v4)
		    (pred_3 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_01 - type_3
obj_06 obj_07 obj_14 obj_13 - type_2
obj_09 obj_02 obj_10 obj_11 - type_1
obj_04 obj_08 obj_05 obj_03 - object)
(:init
(pred_1 obj_12 obj_09)
(pred_3 obj_12 obj_06)
(pred_3 obj_12 obj_07)
(pred_1 obj_01 obj_02)
(pred_3 obj_01 obj_14)
(pred_3 obj_01 obj_13)
(pred_2 obj_04 obj_10)
(pred_2 obj_08 obj_11)
(pred_2 obj_05 obj_09)
(pred_2 obj_03 obj_02)
)
(:goal
(and
(pred_2 obj_04 obj_09)
(pred_2 obj_08 obj_02)
(pred_2 obj_05 obj_02)
(pred_2 obj_03 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_12 obj_02) (pred_1 obj_01 obj_02))))
  )
)
)

; plan
1. (op_1 obj_01 obj_03 obj_02 obj_13)
   deleted: (pred_2 obj_03 obj_02) (pred_3 obj_01 obj_13)
   added: (pred_4 obj_01 obj_03 obj_13)
   goals met: 0 of 4
2. (op_1 obj_12 obj_05 obj_09 obj_07)
   deleted: (pred_2 obj_05 obj_09) (pred_3 obj_12 obj_07)
   added: (pred_4 obj_12 obj_05 obj_07)
   goals met: 0 of 4
3. (op_2 obj_01 obj_02 obj_09)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_09)
   goals met: 0 of 4
4. (op_2 obj_12 obj_09 obj_11)
   deleted: (pred_1 obj_12 obj_09)
   added: (pred_1 obj_12 obj_11)
   goals met: 0 of 4
5. (op_3 obj_01 obj_03 obj_09 obj_13)
   deleted: (pred_4 obj_01 obj_03 obj_13)
   added: (pred_2 obj_03 obj_09) (pred_3 obj_01 obj_13)
   goals met: 1 of 4
6. (op_1 obj_12 obj_08 obj_11 obj_06)
   deleted: (pred_2 obj_08 obj_11) (pred_3 obj_12 obj_06)
   added: (pred_4 obj_12 obj_08 obj_06)
   goals met: 1 of 4
7. (op_2 obj_12 obj_11 obj_02)
   deleted: (pred_1 obj_12 obj_11)
   added: (pred_1 obj_12 obj_02)
   goals met: 1 of 4
8. (op_2 obj_01 obj_09 obj_10)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_10)
   goals met: 1 of 4
9. (op_3 obj_12 obj_05 obj_02 obj_07)
   deleted: (pred_4 obj_12 obj_05 obj_07)
   added: (pred_2 obj_05 obj_02) (pred_3 obj_12 obj_07)
   goals met: 2 of 4
10. (op_3 obj_12 obj_08 obj_02 obj_06)
   deleted: (pred_4 obj_12 obj_08 obj_06)
   added: (pred_2 obj_08 obj_02) (pred_3 obj_12 obj_06)
   goals met: 3 of 4
11. (op_1 obj_01 obj_04 obj_10 obj_13)
   deleted: (pred_2 obj_04 obj_10) (pred_3 obj_01 obj_13)
   added: (pred_4 obj_01 obj_04 obj_13)
   goals met: 3 of 4
12. (op_2 obj_01 obj_10 obj_09)
   deleted: (pred_1 obj_01 obj_10)
   added: (pred_1 obj_01 obj_09)
   goals met: 3 of 4
13. (op_3 obj_01 obj_04 obj_09 obj_13)
   deleted: (pred_4 obj_01 obj_04 obj_13)
   added: (pred_2 obj_04 obj_09) (pred_3 obj_01 obj_13)
   goals met: 4 of 4
